Revit 2027 API
SunAndShadowSettings.SunriseToSunset Property
 Identifies whether the current single day sun study is set to run from sunrise to sunset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool SunriseToSunset { get; set; }
Public Property SunriseToSunset As Boolean
	Get
	Set
public:
property bool SunriseToSunset {
	bool get ();
	void set (bool value);
}
member SunriseToSunset : bool with get, set
Property Value
Boolean
See Also
Reference
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace